var config = {
    gameTime: 10,                           // 游戏时长    
    textCounts: 10,                         // 弹幕总条数
    welcome: '点击屏幕任意位置开始...',       // 欢迎语
    introText: [                            // 游戏提示语
        '你好~',
        '我是古金',
        '欢迎你来我的六一测试',
        '先预祝您六一儿童节快乐',
        '好~下面开始测试,嘻嘻~',
        '请用手指猛戳屏幕!!!',
        '快!',
        '快!',
        '快!',
        '再快!',
        '再快些!'
    ],
    tips: [                                 // pop提示语
        '纯净', '甜美', '简单', '迷幻', '错觉', '短暂', '偏执', '纯粹', '幻想',
        '悠然', '自由', '美好', "兴奋", "快乐", "喜悦", "愉快", "畅快", "欢畅", "欢喜",
        30, "欢快", "欣喜", "潇洒", "甜美", "亲亲", "灿烂", "缠绵", "恬豁", "乐观",
        40, "忻乐", "乐呵", "悠然", "宝贝", "美好", "宠乐", "乐怀", "惬意", "安心",
        50, "舒心", "温馨", "玲珑", "甜蜜", "温馨", "愉悦", "比翼", "连理", "并蒂",
        60, "合欢", "良缘", "天合", "地设", "同心", "鸳鸯", "意合", "璧合", "吉祥",
        70, "白首", "齐眉", "良宵", "甘甜", "甜美", "甘美", "浪漫", "舒服", "开心",
        80, "欣忭", "怡悦", "乐意", "欢跃", "雀跃", "得意", "快活", "高兴", "欢欣",
        90, "温存", "温暖", "温和", "微笑", "欢笑", "嬉笑", "欢颜", "思念", "相思",
        100, "婵娟", "心悦", "美满", "幸福", "可爱", "美丽", "思春", "思韵", "开怀",
        110, "笑颜", "笑容", "喜笑", "欢声", "笑语", "眉开", "眷恋", "爱恋", "思恋",
        120, "热恋", "恬静", "舒适", "恬荡", "恬雅", "恬适", "恬旷", "恬逸", "安然",
        130, "坦然", '决绝', '华丽', '向往', '快乐', '惬意', '安心', '温馨', '玲珑',
        140, '甜蜜', '雀跃', '赞祖国', '世博会', '好给力', '齐努力', '耍耍赖', '蒸年糕',
        150, '鸡儿到', '开怀笑', '糖醋鱼', '穿新衣', '好给力', '家美满', '欢乐声', '乖乖兔', '悠闲鼠'
    ],
    score: [{                                       // 关卡设置
        level: 1,
        sologan: '多动手指,有益于预防心脑血管疾病',
        max: 50,
        age: {
            start: 80,
            end: 120
        },
    }, {
        level: 2,
        sologan: '老当益壮,祝福儿童快乐',
        max: 80,
        age: {
            start: 70,
            end: 80
        },
    }, {
        level: 3,
        sologan: '目测您已经半身入土了',
        max: 100,
        age: {
            start: 60,
            end: 70
        },
    }, {
        level: 4,
        sologan: '回去带你孙子玩泥巴去吧',
        max: 150,
        age: {
            start: 40,
            end: 60
        },
    }, {
        level: 5,
        sologan: '回去陪你儿子玩泥巴吧',
        max: 200,
        age: {
            start: 30,
            end: 40
        },
    }, {
        level: 6,
        sologan: '情人节不过,过什么儿童节,分了吧',
        max: 300,
        age: {
            start: 20,
            end: 30
        },
    }, {
        level: '7-1',
        sologan: ['你一定是个可爱的小王子,拥有无数小姐姐的追求', '你一定是个可爱的小公举,不是的话,也能生个可爱的小公举'],
        max: 500,
        age: {
            start: 10,
            end: 20
        },
    }, {
        level: 8,
        sologan: '好吧,全世界就你最Young,我服!',
        min: 0,
        max: 'MAX',
        age: {
            start: 1,
            end: 10
        },
    }]
}

for (var i = 10; i > 1; i--) {
    config.tips.unshift('+' + i)
}
for (var i = 149; i < 10000; i++) {
    config.tips.push(i)
}